app/Controllers/Mahasiswa.php

INSERT INTO `mahasiswa` (`email`, `nim`, `fullname`, `user_image`, `created_at`, `updated_at`) VALUES ('Jhens@gmail.com', '2015365', 'Jhensen', 'foto.jpg', '2022-11-18 09:58:50', '2022-11-18 09:58:50')
---
            ];
            return $this->response->setJSON($data);
        }
        $return = $this->mahasiswaModel->save([
            'email' => $this->request->getVar('email'),
            'nim' => $this->request->getVar('nim'),
            'fullname' => $this->request->getVar('fullname'),
            'user_image' => $this->request->getVar('userImage'),
        ]);

UPDATE `mahasiswa` SET `email` = NULL, `nim` = NULL, `fullname` = NULL, `user_image` = NULL, `updated_at` = '2022-11-18 10:43:49'
WHERE `mahasiswa`.`id` IN ('3')
---
            ];
            return $this->response->setJSON($data);
        }
        $return = $this->mahasiswaModel->update($id, [
            'email' => $this->request->getVar('email'),
            'nim' => $this->request->getVar('nim'),
            'fullname' => $this->request->getVar('fullname'),
            'user_image' => $this->request->getVar('userImage'),
        ]);

DELETE FROM `mahasiswa`
WHERE `id` IN ('7')
---
    public function remove($id=null)
    {
        $this->mahasiswaModel->delete($id);