app/Controllers/Mahasiswa.php

        }

        // update data
        $this->mahasiswaModel->update($id, $data);
---
UPDATE `mahasiswa` SET `email` = 'ggggg@gmail.com', `nim` = '210277', `fullname` = 'Ini aa', `user_image` = 'asdas', `updated_at` = '2022-11-21 00:01:33'
WHERE `mahasiswa`.`id` IN ('6')